package com.test;

public class Sample {
	
	/*
	과거의 프로그래밍 방법
	- 절차(알고리즘) 중심
	
	현대의 프로그래밍 방법
	- 자료(객체) 중심
	
	객체 지향적 프로그래밍을 이해하려면
	용어에 대한 이해가 필수.
	예를 들어,
	사람은 동물이다 -> O
	동물은 사람이다 -> X
	
	객체(Object)
	- 프로그래밍의 대상이 되는 자료.
	- state(상태), behavior(행동) 분석 필요
	- 모든 것은 객체가 될 수 있다.
	- 예를 들어, 
	리모콘(리모트 컨트롤러)
	: 전원 on/off 행위
	: 메뉴 선택 행위
	: 켜져 있는 상태, 꺼진 상태
	
	클래스(Class)
	- 객체를 실체 프로그래밍적인 방법으로 표현한 것
	- 프로퍼티, 메소드 구성
	- 물리적 구성 가능(.java)
	형식)
	class 클래스이름 {
		//프로퍼티
		//메소드
	}
	
	인스턴스(instance)
	- 클래스가 실제 실행을 위해서 메모리에 일시적으로 적재된 상태
	- 실행 상태
	- 사용을 마친 상태가 되면 메모리에서 제거된다
	- new 연산자 사용
	
	*/

	
}
