/* 
 * 프로그램명: 배열(저장소)을 이용한 성적처리
 * 작성자 : 이민종
 * 작성일 : 20190221
 *  
 */
package com.test;

public class Program069 {

	public static void main(String[] args) {
		
		//문제)
		//과목1, 과목2, 과목3의 점수를 저장하는 배열 저장소 준비
		//각 과목당 인원수는 10명
		//각 과목당 총점, 평균 계산
		//출력예)
		/*
		 1)   100    80   100
		 2)    80   100    90
		 3)    90    95    80
		 4)    50    55    70
		 5)    60    70    80
		 6)    85    90   100
		 7)    80    85    80
		 8)    90   100    90
		 9)   100   100    90
		10)    75    85   100
		    -----------------
		      810   ???   ???
		       81    ??    ??
		*/

		
	}

}
